#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_role.labrole: Reading...
aws_vpc.tc_vpc: Refreshing state... [id=vpc-0007de5a3b5c513a5]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-037a6ab448553f286]
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
aws_subnet.private_subnet_1: Refreshing state... [id=subnet-0f9b75aec58a26762]
aws_security_group.eks_sg: Refreshing state... [id=sg-0cfaa2580e4ad3570]
aws_internet_gateway.tc_internet_gateway: Refreshing state... [id=igw-0d6e5029c15ba588b]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-02d73fe82246eb0f5]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-031c38d9feff86746]
aws_subnet.private_subnet_2: Refreshing state... [id=subnet-0c09c43199d92bca0]
aws_route_table.public_route_table: Refreshing state... [id=rtb-02add637d23389318]
aws_route_table_association.public_association_2: Refreshing state... [id=rtbassoc-0aecc45d110062fda]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0bb0875219e673c46]
aws_route_table_association.public_association_1: Refreshing state... [id=rtbassoc-053ae834b1d756e44]
aws_route_table.private_route_table: Refreshing state... [id=rtb-087a0dac32282b46d]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-037a4e91c3acf98c4]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-026c7403c2faa1383]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks_lanchonete-do-bairro"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "tc",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::318849967381:role/LabRole"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.tc_eks_policy will be created
  + resource "aws_eks_access_policy_association" "tc_eks_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks_lanchonete-do-bairro"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::318849967381:role/LabRole"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.tc_eks_cluster will be created
  + resource "aws_eks_cluster" "tc_eks_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks_lanchonete-do-bairro"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::318849967381:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-0cfaa2580e4ad3570",
            ]
          + subnet_ids                = [
              + "subnet-0c09c43199d92bca0",
              + "subnet-0f9b75aec58a26762",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.tc_eks_node_group will be created
  + resource "aws_eks_node_group" "tc_eks_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eks_lanchonete-do-bairro"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "ng-lanchonete-do-bairro"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::318849967381:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0c09c43199d92bca0",
          + "subnet-0f9b75aec58a26762",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @BrunaPisera, Action: `pull_request`*